app/views/users/_analytics.html.erb

SELECT "rounds".* FROM "rounds" WHERE "rounds"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "rounds" WHERE "rounds"."user_id" = ?  [["user_id", 1]]
---
<% if @user.rounds.count == 0 %>

SELECT "rounds".* FROM "rounds" WHERE "rounds"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "rounds" WHERE "rounds"."user_id" = ?  [["user_id", 1]]
---
</div>
<% elsif @user.rounds.count > 0 %>

SELECT "rounds".* FROM "rounds" WHERE "rounds"."user_id" = ?  [["user_id", 1]]
---
<h3>Total Points: <%= @user.points %> </h3>
<h3>Rounds Played: <%= @user.rounds.count %> </h3>

SELECT "hands".* FROM "hands" WHERE "hands"."round_id" = ?  [["round_id", 1]]
---

    <% if round.hands.count == 2 %>