app/views/users/analytics.html.erb

SELECT "rounds".* FROM "rounds" WHERE "rounds"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "rounds" WHERE "rounds"."user_id" = ?  [["user_id", 1]]
---
<h3>Total Points: <%= @user.points %> </h3>
<h3>Rounds Played: <%= @user.rounds.count %> </h3>

SELECT COUNT(*) FROM "rounds" WHERE "rounds"."user_id" = ?  [["user_id", 1]]
---
<br>
<% if @user.rounds.count > 0 %>

SELECT "rounds".* FROM "rounds" WHERE "rounds"."user_id" = ?  [["user_id", 1]]
---
  <% r = 1 %>
  <% @user.rounds.all.each do |round| %>