app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  </body>
</html><h4>Logged in as <%= User.find(session[:user_id]).username %></h4>