app/controllers/rounds_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cards".* FROM "cards"
---
  def new
    if logged_in? == false
      redirect_user
    end
    @round = Round.new
    @user = User.find(session[:user_id])
    @cards = Card.all

INSERT INTO "rounds" ("user_id", "ante_amount", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["ante_amount", 20], ["created_at", "2019-05-29 23:50:51.058460"], ["updated_at", "2019-05-29 23:50:51.058460"], ["status", "active"]]
UPDATE "users" SET "points" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["points", 840], ["updated_at", "2019-05-30 00:10:14.211826"], ["id", 1]]
INSERT INTO "rounds" ("user_id", "ante_amount", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["ante_amount", 100], ["created_at", "2019-05-30 00:10:14.213952"], ["updated_at", "2019-05-30 00:10:14.213952"], ["status", "active"]]
INSERT INTO "hands" ("round_id", "created_at", "updated_at", "is_player_hand") VALUES (?, ?, ?, ?)  [["round_id", 6], ["created_at", "2019-05-30 00:18:12.655463"], ["updated_at", "2019-05-30 00:18:12.655463"], ["is_player_hand", 0]]
---
  def create
    @round = Round.new(round_params())
    @user = @round.user
    #attempts to decrement ante from user, fails if
    if @user.ante(@round.ante_amount)
      @user.save
    else
      #Flash error this?
      'Error, not enough points for this ante'
      #Re-render new page?
    end
    @round.save
    @d_hand = @round.deal_dealer_hand
    @p_hand = @round.deal_player_hand
    @round.hands << @d_hand

SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "hands".* FROM "hands" WHERE "hands"."round_id" = ?  [["round_id", 8]]
---
  def edit
    @round = Round.find(params[:id])
    @user = @round.user
    @hands = @round.hands.to_a

SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "rounds" SET "status" = ?, "updated_at" = ? WHERE "rounds"."id" = ?  [["status", "bet"], ["updated_at", "2019-05-30 00:38:50.424791"], ["id", 10]]
---
  def update
    @round = Round.find(params[:id])
    @user = @round.user
    @hands = @round.hands.to_a
    @d_hand = @hands.find{|h| h.is_player_hand == false}
    @p_hand = @hands.find{|h| h.is_player_hand == true}
    if @round.update(round_params())

SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @round = Round.find(params[:id])
    @user = @round.user
    @hands = @round.hands.to_a