app/controllers/users_controller.rb

  def index

    if logged_in?
      @current_user = User.find(session[:user_id])
      @users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "username", "points", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Milan"], ["username", "milandhar5"], ["points", 1000], ["created_at", "2019-05-29 16:52:48.384009"], ["updated_at", "2019-05-29 16:52:48.384009"]]