app/models/card.rb

  def face
    case self.value
    when 14
      "Ace"
    when 13
      "King"
    when 12
      "Queen"
    when 11
      "Jack"
    when 10
      "Ten"
    else
      self.value.to_s
---
SELECT "cards".* FROM "cards" WHERE (is_dealt = false)

  def self.deal(n=1)
    available_cards = Card.where("is_dealt = false")
    hand = available_cards.sample(n)
    hand.each do |c|
      c.is_dealt = true
      c.save
---
SELECT "cards".* FROM "cards" WHERE (is_dealt = false)
UPDATE "cards" SET "is_dealt" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["is_dealt", 1], ["updated_at", "2019-05-29 19:56:12.346213"], ["id", 10]]

  def self.reset_deck
    Card.update_all(is_dealt: false)
---
UPDATE "cards" SET "is_dealt" = 0