app/models/hand.rb

  def dealer_card_reveal
    self.cards.last.short
---
SELECT  "cards".* FROM "cards" INNER JOIN "hand_cards" ON "cards"."id" = "hand_cards"."card_id" WHERE "hand_cards"."hand_id" = ? ORDER BY "cards"."id" DESC LIMIT ?  [["hand_id", 8], ["LIMIT", 1]]

  def show_short
    self.cards.each{|c| puts c.short}
---
SELECT "cards".* FROM "cards" INNER JOIN "hand_cards" ON "cards"."id" = "hand_cards"."card_id" WHERE "hand_cards"."hand_id" = ?  [["hand_id", 9]]