app/models/round.rb

  def deal_dealer_hand
    Hand.create({round_id: self.id, is_player_hand: false})
---
INSERT INTO "hands" ("round_id", "created_at", "updated_at", "is_player_hand") VALUES (?, ?, ?, ?)  [["round_id", 6], ["created_at", "2019-05-30 00:18:12.655463"], ["updated_at", "2019-05-30 00:18:12.655463"], ["is_player_hand", 0]]

  def deal_player_hand
    Hand.create({round_id: self.id, is_player_hand: true})
---
INSERT INTO "hands" ("round_id", "created_at", "updated_at", "is_player_hand") VALUES (?, ?, ?, ?)  [["round_id", 6], ["created_at", "2019-05-30 00:18:12.678353"], ["updated_at", "2019-05-30 00:18:12.678353"], ["is_player_hand", 1]]